pascal-4.0/tutorials/surfaceTracking/newInterFreeFoam/capillarity2D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.2                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    topWall
    {
        type            slip;
    }
    freeSurfaceShadow
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    freeSurface
    {
        type            fixedGradient;
        gradient        uniform (0 0 0);
    }
    leftWall
    {
        type            slip;
    }
    rightWall
    {
        type            slip;
    }
    bottomWall
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
